[
    {
        "name": "プログラミング初心者向けの学習ステップ",
        "summary": "私がプログラミング初心者のときに実際にやってみて効果的だった学習順番を共有します。\n\nプログラミング初心者の方にオススメの学習順番は、まずは基礎的なプログラミング言語を学ぶことです。例えば、PythonやJavaScriptなどがおすすめです。それから、プログラミングの基本的な概念や構文、データ型などを学びます。次に、制御構文や関数、オブジェクト指向などの応用的な内容に進みます。最後に、実際にプロジェクトを作成しながら実践的なスキルを身につけることで、学習をより深化させることができます。\n\nこの学習順番で学んでいくと、基礎から応用まで段階的に学ぶことができ、プログラミングの基本的な理解が身につきます。",
        "category_id": 1,
        "achievement_time_type_id": 2,
        "sub_steps": [
            {
                "name": "基本的なプログラミング言語の学習",
                "detail": "最初にPythonやJavaScriptなどのプログラミング言語を学ぶことをおすすめします。これにより、プログラミングの基本的な概念や構文、データ型などを学ぶことができます。オンラインのチュートリアルや教材を利用し、基礎をしっかりと身につけましょう。\n\nまた、プログラミング言語の学習には、実際にコードを書きながら試してみることも重要です。簡単なプログラムを作成しながら、実際に動かしてみることで、プログラミングの基本的な構文やロジックを理解しやすくなります。",
                "sort_number": 1
            },
            {
                "name": "プログラムの実行とデバッグの練習",
                "detail": "プログラミング言語の学習が終わったら、次に基本的な概念や構文を学ぶことをおすすめします。例えば、変数、条件分岐、繰り返し、関数などがあります。\n\nこれらの基本的な概念や構文を理解することで、プログラミングの基本的な流れやロジックを理解することができます。オンラインの教材や参考書を活用して、基本的な概念や構文をじっくり学習しましょう。\n\nまた、実際に自分でコードを書きながら試してみることも重要です。簡単なプログラムを作成しながら、基本的な構文やロジックを実践的に理解することで、より深い学びが可能になります。",
                "sort_number": 2
            },
            {
                "name": "プログラムの応用例を学習",
                "detail": "基本的な概念や構文を理解したら、次に応用的な内容に進みましょう。例えば、制御構文の高度な使い方や関数の活用、オブジェクト指向プログラミングの学習などがあります。\n\nこれらの応用的な内容を学ぶことで、より高度なプログラムの作成が可能になります。オンラインの教材や参考書を利用し、徐々に応用的なスキルを身につけていきましょう。",
                "sort_number": 3
            },
            {
                "name": "プログラムの実践的な開発",
                "detail": "応用的な内容を学習したら、最後に実践的なプロジェクトを作成しながら実践的なスキルを身につけましょう。例えば、Webアプリケーションの作成やゲームの開発など、実際のプロジェクトを通じて、自分で考えながらコードを書く経験を積むことが重要です。\n\n実践的なプロジェクトを通じて、自分自身で課題を解決しながらプログラムを作成することで、より実践的なスキルを身につけることができます。自分自身で作成したプロジェクトを公開したり、実際に動かしてみたりすることで、より自信を持ってプログラミングを楽しむことができます。",
                "sort_number": 4
            }
        ]
    },
    {
        "name": "英語学習の基礎",
        "summary": "英語学習の基礎として、まずはアルファベットの発音と基本的な単語の覚え方を学びます。初心者向けのSTEPです。",
        "category_id": 1,
        "achievement_time_type_id": 1,
        "sub_steps": [
            {
                "name": "アルファベットの発音を覚える",
                "detail": "英語のアルファベットの発音を覚えます。日本語とは異なる発音のルールを理解し、正しい発音を身につけます。",
                "sort_number": 1
            },
            {
                "name": "基本的な単語を覚える",
                "detail": "日常会話でよく使われる基本的な単語を覚えます。挨拶や自己紹介、数字などの単語を学びます。",
                "sort_number": 2
            },
            {
                "name": "シンプルな文章を作る",
                "detail": "覚えた単語を使ってシンプルな英語の文章を作成します。自己紹介や簡単な質問応答などを練習します。",
                "sort_number": 3
            }
        ]
    },
    {
        "name": "英語のリスニング力を向上させる",
        "summary": "英語のリスニング力を向上させるためのステップです。実践的な方法を学びながら、リスニングスキルを伸ばします。",
        "category_id": 1,
        "achievement_time_type_id": 2,
        "sub_steps": [
            {
                "name": "英語の音声教材を聴く",
                "detail": "英語の音声教材を聴きます。リスニング力を高めるための基本的な方法を学びながら、音声を聴いて理解力を鍛えます。",
                "sort_number": 1
            },
            {
                "name": "英語のニュースを聴く",
                "detail": "英語のニュースを聴いてリスニング力を向上させます。速いスピードでの英語を聴き取る練習を通じて、リスニングスキルを高めます。",
                "sort_number": 2
            }
        ]
    },
    {
        "name": "英語学習の基本",
        "summary": "英語学習の基本的なステップを紹介します。英語初心者向けの内容で、英語の基礎を固めるためのステップです。毎日少しずつ取り組むことで、英語の基礎を身に付けることができます。ステップ1から順番に進めることをおすすめします。",
        "category_id": 1,
        "achievement_time_type_id": 1,
        "sub_steps": [
            {
                "name": "単語の学習",
                "detail": "英単語の学習を始めます。毎日10～20個の単語を覚えることを目標にしましょう。初心者向けの単語帳やアプリを使って、発音やスペルを覚えましょう。",
                "sort_number": 1
            },
            {
                "name": "基本文法の学習",
                "detail": "英語の基本的な文法を学習します。文法書やオンラインの学習サイトを使って、基本的な文法ルールを理解しましょう。例文を使って練習をし、自分で文を作る練習もしましょう。",
                "sort_number": 2
            },
            {
                "name": "リスニングの練習",
                "detail": "英語のリスニング力を向上させるために、英語の音声を聞きながらリスニングの練習をしましょう。英語のニュースや簡単な英語の会話を聞いて、内容を理解する練習をしましょう。",
                "sort_number": 3
            },
            {
                "name": "簡単な文の作成",
                "detail": "学習した単語と文法を使って、簡単な英文を作成しましょう。自分で日常会話のシーンを想定して、簡単な英文を作成する練習をしましょう。間違いをチェックし、修正することも大切です。",
                "sort_number": 4
            }

        ]
    },
    {
        "name": "3ヶ月で10kg痩せる!私のダイエット法",
        "summary": "私が3ヶ月で10kg痩せたダイエット法を紹介します。ダイエットには、食事制限や運動など様々な方法がありますが、私は食事制限で炭水化物をとる量を減らし筋トレをすることで痩せることができました。",
        "category_id": 1,
        "achievement_time_type_id": 1,
        "sub_steps": [
            {
                "name": "筋トレをする",
                "detail": "500mlのペットボトルを使ってダンベルローイング(ダンベルを持ち上げて力こぶを鍛えるやつ)と、ダンベルプレス、あと体幹トレーニングとしてプランクをしました。\n この時に大事なことは、思い切りトレーニングして、運動することの楽しさを思い出すことです。ダイエットって自分の理想の体を手に入れたくてやると思うんです。私はただ痩せてるだけじゃなくて、メリハリのある体が欲しかったので、脂肪がないだけじゃなく筋肉もほしかった。筋肉がつくことで代謝もあがって痩せやすい体になるっていう話を聞いたので、まずは筋トレで筋肉をつけるようにしました。週2回、記録をとって毎回以前の記録を超えるつもりでトレーニングするようにしました。2ヶ月続けるころには筋トレが自分の習慣になったかな、という感じがしました。",
                "sort_number": 1
            },
            {
                "name": "食事変える",
                "detail": "筋トレをはじめて1ヶ月くらい経ったころから食事をタンパク質多めにするよう意識するようにしました。ただ、これも痩せるためっていうよりは、もっと筋トレの記録を伸ばしたい！っていう気持ちでやった感じです。はじめて最初の1ヶ月で毎回筋トレの記録が伸びて、うっすら力こぶも出てきて嬉しくて！食事を変えればもっと良くなると思うとあまり辛くありませんでした。",
                "sort_number": 2
            },
            {
                "name": "定期的に体重を測る",
                "detail": "今までこわくて体重計の乗ることがそんななかったんですが、筋トレで筋肉がついてきてから体つきが変わってきました。それで自分自身に自信もついて、体重計に乗るようにしました。筋トレ始める前と、初めて1ヶ月経ってからで体重は1kgしか減ってなかったんですが、体型が変わってきてるのは自覚してたので安心して継続しました。",
                "sort_number": 3
            },
            {
                "name": "就寝時間を変え、寝る前にプロテインを飲む",
                "detail": "深夜1,2時まで夜更かして、その間に夜食を食べてしまうクセがありました。ただ、筋トレの後に遅く寝ると、翌日の疲れがひどくてけっこう辛くて。なので、12時までには寝るようにしました。筋また、寝る前にプロテインを飲むことで、夜食の誘惑からに打ち勝てるようになりました。",
                "sort_number": 4
            }
        ]
    }
]
